#Задача 2

#Пользователь вводит строку

stroka = input("Введите строку: ")
stroka = '.'.join(stroka)
print("Результат: ", stroka)
