#Задача 2

chislo = input("Введите число: ")#число передается в качестве параметра
def count (chislo):
    print(len(chislo))
count(chislo)


