#Задание 1

число_1 = int(input("Введите 1 число: "))
число_2 = int(input("Введите 2 число: "))

for i in range(число_1, число_2): #диапозон от число_1 до число_2 включительно
    print(i)
print(число_2)