#Пользователь вводит количество метров:

метр=int(input("Введите количество метров: "))

print(метр*100, "cм") #результат перевода в "см"

print(метр*10, "дм") #результат перевода в "дм"

print(метр*1000, "мм") #результат перевода в "мм"

print(метр*1609, "мили") #результат перевода в "мили"